src/cf/InformationRegisters/РезультатыОбработкиЗаданийРаспознаваниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыОбработкиЗаданийРаспознаваниеДокументов</Name>
			<Comment>Содержит список идентификаторов загруженных документов, а также идентификаторы файлов, из которых документ был собран</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИменаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыОбработкиЗаданийРаспознаваниеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьРезультатОбработкиДокумента(ИдентификаторЗадания, РезультатыОбработки) Экспорт
	
	Для Каждого ИдентификаторФайла Из РезультатыОбработки.ФайлыДокумента Цикл
		Запись = РегистрыСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторРезультата = РезультатыОбработки.ИдентификаторРезультата;
		Запись.ИдентификаторФайла = ИдентификаторФайла;
		Запись.ИдентификаторЗадания = ИдентификаторЗадания;
		Запись.ИменаФайлов = РезультатыОбработки.ИменаФайлов;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдФайловПоИдРезультата(ИдентификаторРезультата) Экспорт
	
	ИдентификаторыФайлов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыОбработкиЗаданийРаспознаваниеДокументов.ИдентификаторФайла КАК ИдентификаторФайла
		|ИЗ
		|	РегистрСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов КАК РезультатыОбработкиЗаданийРаспознаваниеДокументов
		|ГДЕ
		|	РезультатыОбработкиЗаданийРаспознаваниеДокументов.ИдентификаторРезультата = &ИдентификаторРезультата";
	
	Запрос.УстановитьПараметр("ИдентификаторРезультата", ИдентификаторРезультата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторыФайлов.Добавить(Выборка.ИдентификаторФайла);
		
	КонецЦикла;
	
	Возврат ИдентификаторыФайлов;
	
КонецФункции

Процедура УдалитьЗаписиПоИдРезультата(ИдентификаторРезультата) Экспорт
	
	Набор = РегистрыСведений.РезультатыОбработкиЗаданийРаспознаваниеДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторРезультата.Установить(ИдентификаторРезультата);
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
